In [109]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [110]:
df = pd.read_csv("C:/Users/duffzord/Documents/R-DEV/FIAP/Projetos/machineLearning/Projects/python-lemonade/Lemonade2016.csv")

In [111]:
df.head()

       Date Location  Lemon  Orange  Temperature  Leaflets  Price
0  7/1/2016     Park     97      67           70      90.0   0.25
1  7/2/2016     Park     98      67           72      90.0   0.25
2  7/3/2016     Park    110      77           71     104.0   0.25
3  7/4/2016    Beach    134      99           76      98.0   0.25
4  7/5/2016    Beach    159     118           78     135.0   0.25

In [112]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 7 columns):
Date           31 non-null object
Location       32 non-null object
Lemon          32 non-null int64
Orange         32 non-null int64
Temperature    32 non-null int64
Leaflets       31 non-null float64
Price          32 non-null float64
dtypes: float64(2), int64(3), object(2)
memory usage: 1.8+ KB

In [113]:
df.describe()

            Lemon      Orange  Temperature    Leaflets      Price
count   32.000000   32.000000    32.000000   31.000000  32.000000
mean   116.156250   80.000000    78.968750  108.548387   0.354687
std     25.823357   21.863211     4.067847   20.117718   0.113137
min     71.000000   42.000000    70.000000   68.000000   0.250000
25%     98.000000   66.750000    77.000000   90.000000   0.250000
50%    113.500000   76.500000    80.500000  108.000000   0.350000
75%    131.750000   95.000000    82.000000  124.000000   0.500000
max    176.000000  129.000000    84.000000  158.000000   0.500000

In [114]:
df.isnull().any()

Date            True
Location       False
Lemon          False
Orange         False
Temperature    False
Leaflets        True
Price          False
dtype: bool

In [115]:
df.isnull().sum()

Date           1
Location       0
Lemon          0
Orange         0
Temperature    0
Leaflets       1
Price          0
dtype: int64

In [116]:
df[df['Date'].isnull()]

  Date Location  Lemon  Orange  Temperature  Leaflets  Price
8  NaN    Beach    123      86           82     113.0   0.25

In [117]:
df[6:11]

         Date Location  Lemon  Orange  Temperature  Leaflets  Price
6    7/6/2016    Beach    103      69           82      90.0   0.25
7    7/7/2016    Beach    143     101           81     135.0   0.25
8         NaN    Beach    123      86           82     113.0   0.25
9    7/9/2016    Beach    134      95           80     126.0   0.25
10  7/10/2016    Beach    140      98           82     131.0   0.25

In [118]:
df['Date'].fillna('7/8/2016', inplace = True)

In [119]:
df['Date'][8]

'7/8/2016'

In [120]:
df[df['Leaflets'].isnull()]

         Date Location  Lemon  Orange  Temperature  Leaflets  Price
20  7/20/2016     Park     71      42           70       NaN    0.5

In [121]:
df[18:23]

         Date Location  Lemon  Orange  Temperature  Leaflets  Price
18  7/18/2016     Park    131      92           81     122.0    0.5
19  7/19/2016     Park    122      85           78     113.0    0.5
20  7/20/2016     Park     71      42           70       NaN    0.5
21  7/21/2016     Park     83      50           77      90.0    0.5
22  7/22/2016     Park    112      75           80     108.0    0.5

In [122]:
df[df['Location'] == 'Park'].mean()['Leaflets'].round(decimals = 0)

109.0

In [123]:
df['Leaflets'].interpolate(inplace = True)

In [124]:
df['Leaflets'] = df['Leaflets'].round(decimals = 0)

In [125]:
df['Leaflets'][20]

102.0

In [126]:
df[df.duplicated()]

       Date Location  Lemon  Orange  Temperature  Leaflets  Price
6  7/6/2016    Beach    103      69           82      90.0   0.25

In [127]:
df.drop_duplicates(inplace = True)

In [128]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 31 entries, 0 to 31
Data columns (total 7 columns):
Date           31 non-null object
Location       31 non-null object
Lemon          31 non-null int64
Orange         31 non-null int64
Temperature    31 non-null int64
Leaflets       31 non-null float64
Price          31 non-null float64
dtypes: float64(2), int64(3), object(2)
memory usage: 1.9+ KB

In [129]:
df['Sales'] = df['Lemon'] + df['Orange']

In [130]:
df['Revenue'] = df['Sales'] * df['Price']

In [131]:
df['Revenue'].sum()

2138.0

In [132]:
def temp_analise(dataset,temp):
    '''
    Retorna o valor da temperatura (min/media/max) para o dataset de entrada
    Input:
        dataset = conjunto de dados
        temp    =  1 para temperatura máxima
                =  0 para temperatura média
                = -1 para temperatura mínima
    Output: temperatura
    '''    
    if temp == 1:
        return dataset['Temperature'].max()
    if temp == 0:
        return dataset['Temperature'].mean()
    if temp == -1:
        return dataset['Temperature'].min()

In [133]:
print('Temperatura máxima: %.1f' % temp_analise(df,1))
print('Temperatura média: %.1f' % temp_analise(df,0))
print('Temperatura mínima: %.1f' % temp_analise(df,-1))

Temperatura máxima: 84.0
Temperatura média: 78.9
Temperatura mínima: 70.0

In [136]:
def loc_reajpreco(dataset,localizacao):
    '''
    Reajusta o preço de acordo com a localidade
    Input:
        dataset        = conjunto de dados
        localizacao    =  'Park' ou 'Beach'
    Output: dataset com o preço reajustado
    '''
    if localizacao == 'Park':
        df[df['Location'] == 'Park']['Price'] = (df[df['Location'] == 'Park']['Price'] * 1.15).round(decimals = 2)
        return df
    if localizacao == 'Beach':
        df[df['Location'] == 'Beach']['Price'] = (df[df['Location'] == 'Beach']['Price'] * 1.10).round(decimals = 2)
        return df

In [137]:
loc_reajpreco(df, 'Park')

C:\Users\duffzord\Anaconda3\lib\site-packages\ipykernel_launcher.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  # Remove the CWD from sys.path while we load stuff.

,Date,Location,Lemon,Orange,Temperature,Leaflets,Price,Sales,Revenue
0,7/1/2016,Park,97,67,70,90.0,0.29,164,41.00
1,7/2/2016,Park,98,67,72,90.0,0.29,165,41.25
2,7/3/2016,Park,110,77,71,104.0,0.29,187,46.75
3,7/4/2016,Beach,134,99,76,98.0,NaN,233,58.25
4,7/5/2016,Beach,159,118,78,135.0,NaN,277,69.25
5,7/6/2016,Beach,103,69,82,90.0,NaN,172,43.00
7,7/7/2016,Beach,143,101,81,135.0,NaN,244,61.00
8,7/8/2016,Beach,123,86,82,113.0,NaN,209,52.25
9,7/9/2016,Beach,134,95,80,126.0,NaN,229,57.25
10,7/10/2016,Beach,140,98,82,131.0,NaN,238,59.50
11,7/11/2016,Beach,162,120,83,135.0,NaN,282,70.50
12,7/12/2016,Beach,130,95,84,99.0,NaN,225,56.25
13,7/13/2016,Beach,109,75,77,99.0,NaN,184,46.00
14,7/14/2016,Beach,122,85,78,113.0,NaN,207,51.75
15,7/15/2016,Beach,98,62,75,108.0,NaN,160,80.00
16,7/16/2016,Beach,81,50,74,90.0,NaN,131,65.50
17,7/17/2016,Beach,115,76,77,126.0,NaN,191,95.50
18,7/18/2016,Park,131,92,81,122.0,0.57,223,111.50
19,7/19/2016,Park,122,85,78,113.0,0.57,207,103.50
20,7/20/2016,Park,71,42,70,102.0,0.57,113,56.50
21,7/21/2016,Park,83,50,77,90.0,0.57,133,66.50
22,7/22/2016,Park,112,75,80,108.0,0.57,187,93.50
23,7/23/2016,Park,120,82,81,117.0,0.57,202,101.00
24,7/24/2016,Park,121,82,82,117.0,0.57,203,101.50
25,7/25/2016,Park,156,113,84,135.0,0.57,269,134.50
26,7/26/2016,Park,176,129,83,158.0,0.40,305,106.75
27,7/27/2016,Park,104,68,80,99.0,0.40,172,60.20
28,7/28/2016,Park,96,63,82,90.0,0.40,159,55.65
29,7/29/2016,Park,100,66,81,95.0,0.40,166,58.10
30,7/30/2016,Beach,88,57,82,81.0,NaN,145,50.75
31,7/31/2016,Beach,76,47,82,68.0,NaN,123,43.05

In [108]:
(0.25*1.15)

0.2875

0     1.45
1     1.45
2     1.45
18    2.85
19    2.85
20    2.85
21    2.85
22    2.85
23    2.85
24    2.85
25    2.85
26    2.00
27    2.00
28    2.00
29    2.00
Name: Price, dtype: float64